In [1]:
#Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [7]:
import pandas as pd

In [8]:
d=pd.Series([4,8,15,16,23,42])

In [9]:
d

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [10]:

'''Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it.'''

l1=[]

In [12]:
for i in range(23,34):
    l1.append(i)

In [13]:
l1

[23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33]

In [17]:
d1=pd.Series(l1)

In [20]:
d1

0     23
1     24
2     25
3     26
4     27
5     28
6     29
7     30
8     31
9     32
10    33
dtype: int64

In [21]:
#Q3. Create a Pandas DataFrame that contains the following data:

#Then, print the DataFrame.

In [23]:
d2=pd.DataFrame({"Name":['Alice','Bob','Claire'],"Age":[25,30,27],"Gender":["Female",'Male',"Female"]})

In [24]:
d2

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [26]:
#Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.


'''structure that organizes data into a 2-dimensional table of rows and columns, much like a spreadsheet.
DataFrames are one of the most common data structures used in modern data analytics because they are a
flexible and intuitive way of storing and working with data.



A Pandas Series is like a column in a table. It is a one-dimensional array holding data of any type.'''

'structure that organizes data into a 2-dimensional table of rows and columns, much like a spreadsheet.\nDataFrames are one of the most common data structures used in modern data analytics because they are a\nflexible and intuitive way of storing and working with data.\n\n\n\nA Pandas Series is like a column in a table. It is a one-dimensional array holding data of any type.'

In [28]:
#Example of Data-Frame
d3=pd.DataFrame({'a':[1,2,3,4],'b':[3,5,4,2]})
#Example of Series
d4=pd.Series([5,6,7,8,8])

In [29]:
d3

   a  b
0  1  3
1  2  5
2  3  4
3  4  2

In [30]:
d4

0    5
1    6
2    7
3    8
4    8
dtype: int64

#Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
#you give an example of when you might use one of these functions?


'''It is one of the commonly used Pandas functions for manipulating a pandas dataframe and creating new variables.
Pandas Apply function returns some value after passing each row/column of a data frame with some function. 
The function can be both default or user-defined.'''

In [6]:
import pandas as pd

In [7]:
d4=pd.DataFrame({'a':[33,2,3,4],'b':[4,5,6,7]})

In [9]:
d4

    a  b
0  33  4
1   2  5
2   3  6
3   4  7

Q6. Which of the following is mutable in nature Series, DataFrame, Panel?


Ans:-

List is mutable and Tuple is immutable. A mutable data type means that a python object of this type can be modified.

Q7. Create a DataFrame using multiple Series. Explain with an example.

Ans:-

You can create a DataFrame from multiple Series objects by adding each series as a columns. By using concat() method you can merge multiple series together into DataFrame. This takes several params, for our scenario we use list that takes series to combine and axis=1 to specify merge series as columns instead of rows.

##Example

In [11]:
l1=['B.C.A','M.C.A','B.E']

In [12]:
l2=[60000,50000,80000]

In [13]:
l3=[10000,15000,25000]

In [14]:
course=pd.Series(l1)

In [15]:
fee=pd.Series(l2)

In [16]:
discount=pd.Series(l3)

In [27]:
df5=pd.concat([course,fee,discount],axis=1)

In [25]:
df5

0    B.C.A
1    M.C.A
2      B.E
0    60000
1    50000
2    80000
0    10000
1    15000
2    25000
dtype: object

In [28]:
df5

       0      1      2
0  B.C.A  60000  10000
1  M.C.A  50000  15000
2    B.E  80000  25000